%##########################################################################


%                           RGB 2 θml LUT生成Bin

% 2017 08 19 窦智
%##########################################################################

clc;clear;close all;  % 清理
Pi=3.1415926;
s2=sqrt(2);
%% ======================= 生成查找域 ========================
p=1;MaxG=255;
for i=0:MaxG
    for j=0:MaxG
        for k=0:MaxG
            R1(p)=i/255;
            G1(p)=j/255;
            B1(p)=k/255;
            p=p+1;
        end
    end
end

%% ======================== RGB2Lab =========================

g=0.04045;
XG = R1 > g; 
YG = G1 > g; 
ZG = B1 > g;

R = XG .* (((R1+0.055)/1.055).^2.4) + (~XG) .* (R1/12.92); 
G = YG .* (((G1+0.055)/1.055).^2.4) + (~YG) .* (G1/12.92);
B = ZG .* (((R1+0.055)/1.055).^2.4) + (~ZG) .* (B1/12.92); 

X = (R * 0.4124 + G * 0.3576 + B * 0.1805)./0.950456;
Y = (R * 0.2126 + G * 0.7152 + B * 0.0722);
Z = (R * 0.0193 + G * 0.1192 + B * 0.9505)./ 1.088754;

t = (6/29)^3; 
a = (1/3)*(29/6)^2;
b = 4/29;
XT = X > t; 
YT = Y > t; 
ZT = Z > t;

fX = XT .* X.^(1/3) + (~XT) .* (a .* X + b); 
fY = YT .* Y.^(1/3) + (~YT) .* (a .* Y + b);
fZ = ZT .* Z.^(1/3) + (~ZT) .* (a .* Z + b); 

%************* 浮点/整型 输出 **************
L = 116 * fY - 16.0; 
A = 500 * (fX - fY); 
B = 200 * (fY - fZ); 
            % 浮点△ 2选1 ▽整型 %
% L = int64(100000000000*(116 * fY - 16.0)); 
% A = int64(100000000000*(500 * (fX - fY))); 
% B = int64(100000000000*(200 * (fY - fZ))); 
%*******************************************

%% ======================== Lab2θml =========================

Lc=(Pi+atan2(A,B))/(2*Pi);
Lm= sqrt(A.^2+B.^2)/(255*s2);
Ll=L/100;
% XT = M > 0.012; 
% M = double(XT);

%% ======================= 生成Bin文件 ========================
% fid=fopen('L.txt','w');fprintf(fid,'%d\t',L);fclose(fid);
% fid=fopen('A.txt','w');fprintf(fid,'%d\t',A);fclose(fid);
% fid=fopen('B.txt','w');fprintf(fid,'%d\t',B);fclose(fid);
                  % 字符型△ 2选1 ▽二进制型 %
% fid=fopen('c.bin','wb');fwrite(fid,Lc,'double');fclose(fid);
% fid=fopen('m.bin','wb');fwrite(fid,Lm,'double');fclose(fid);
% fid=fopen('l.bin','wb');fwrite(fid,Ll,'double');fclose(fid);
save data Lc Lm Ll;
%% ======================== 图像处理 =========================
% Io=ImgDis(Lc,Lm,Ll);

